Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_crc/src/rx_dmaca.c
/* libs/rx_crc/src/rx_dmaca.c */

/**
 * @file    rx_dmaca.c
 * @brief   DMACA driver for RX72N
 * @version 1.0.0
 *
 * Implements the API declared in rx_dmaca.h.
 *
 * Hardware references:
 *   RX72N Hardware Manual Sec.18  (DMACA)
 *   RX72N Hardware Manual Sec.46  (CRCA)
 *   RX Family Register Access  iodefine.h / r_bsp header set
 *
 * Design constraints honoured:
 *   - 8-bit and 32-bit transfers only -- 16-bit is prohibited for CRCDIR.
 *   - Destination address is NEVER incremented for CRCDIR use.
 *   - All completion loops are bounded (NASA Rule 2).
 *   - No dynamic memory allocation (NASA Rule 3).
 *   - Every public function validates its arguments and returns rx_err_t.
 *
 * @details
 * Internal implementation of the DMACA abstraction layer used by the
 * CRC driver.  Provides initialization, channel configuration, start,
 * polling wait, and abort functionality.  The code avoids dynamic
 * allocation and uses compile-time constants; all loops are bounded to
 * satisfy safety-critical restrictions.
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 2: Bounded loops for DMA polling and configuration
 * - Rule 3: No dynamic memory allocation anywhere in this file
 * - Rule 5: Argument validation in every public API with pre/post
 *            conditions documented
 * - Rule 7: All return values checked by callers
 *
 * @par SOLID Principles Adherence:
 * - Single Responsibility: each function performs exactly one task (init,
 *   configure, start, wait, abort)
 * - Open/Closed: configuration structure allows new transfer modes without
 *   modifying existing code
 * - Liskov Substitution: validate_channel ensures any channel index is
 *   safely handled, making higher-level code agnostic to invalid inputs
 * - Interface Segregation: small, focused API (configure/start/wait/abort)
 * - Dependency Inversion: high-level drivers depend on this abstract API
 *   rather than raw hardware registers
 *
 * @see docs/sections/06_nasa_power_of_10.tex
 * @see docs/sections/04_style_guide.tex
 * @see docs/sections/07_gateway_architecture.tex
 *
 * @author STAR Team
 * @date 2026-02-22
 * @copyright Copyright (c) 2026 STAR Project - MIT License
 */



#include "rx_dmaca.h"
#include <stddef.h>          /* NULL */
#include "rx_err.h"
#include "rx_check.h"       /* runtime validation macros */

/* hardware register definitions for DMAC (RX72N) */
#include "rx72n_dmac_regs.h"  /* exposes rx_dmac_channel_regs_t, dmac_dmast_reg(), k_dmast_dmst */


/* =========================================================================
 * Internal helpers -- register access
 *
 * The RX72N iodefine.h exposes DMAC channels as an array:
 *   DMAC0 ... DMAC7  or  DMAC[0] ... DMAC[7]  (BSP-version-dependent)
 *
 * We use a small inline accessor to keep channel selection uniform.
 * ========================================================================= */

/* ------------------------------------------------------------------
 * Private constants
 * ------------------------------------------------------------------ */

/**
 * @enum dmac_hw_t
 * @brief Hardware addresses for DMAC channel calculation
 *
 * @details
 * The DMAC register blocks for channels 0-7 are laid out in memory at a
 * fixed base address with a constant stride between consecutive channels.
 * These named constants replace raw literals in pointer arithmetic to make
 * the relationship explicit and easier to audit.
 *
 * @invariant DMACA_CHANNEL_STRIDE must equal k_dmac_channel_size and must 
 * remain constant throughout the program execution to ensure correct channel 
 * register access.
 *
 * @code
 * // Example: compute base address for a channel
 * uintptr_t channel_addr = k_dmac0_base_addr + (ch_index * DMACA_CHANNEL_STRIDE);
 * volatile rx_dmac_channel_regs_t *p_ch = (volatile rx_dmac_channel_regs_t *)channel_addr;
 * @endcode
 *
 * @see dmac_ch, k_dmac0_base_addr, k_dmac_channel_size
 * @since 1.0.0
 */
/* Local alias for hardware register layout constant from rx72n_dmac_regs.h */

typedef enum : uint32_t {
    DMACA_CHANNEL_STRIDE = k_dmac_channel_size,       /**< bytes between channels */
} dmac_hw_t;

/**
 * @enum dmaca_const_t
 * @brief Local register constants for DMACA control values
 *
 * @details
 * Defines named constants for register clearing operations and software
 * request bit values. These are represented as a typed enum (uint8_t) per
 * C23 style guidelines to avoid magic numbers and enable compile-time type
 * checking. Call sites must cast values to uint8_t when writing directly to
 * hardware registers that require the uint8_t type.
 *
 * @invariant All values must match hardware register encodings and bit
 * positions defined in the RX72N datasheet for DMACA control registers.
 *
 * @par Example:
 * @code
 * // Clear interrupt enable flag by writing DMINT register
 * ch->DMINT = (uint8_t)DMACA_DMINT_CLEAR;
 *
 * // Clear status flags by writing DMSTS register
 * ch->DMSTS = (uint8_t)DMACA_DMSTS_CLEAR;
 *
 * // Trigger software request
 * ch->DMAMD |= (uint8_t)DMACA_SWREQ_REQUEST;
 * @endcode
 *
 * @see DMACA_DMINT_CLEAR, DMACA_DMSTS_CLEAR, DMACA_SWREQ_REQUEST
 * @since 1.0.0
 */
typedef enum : uint8_t {
    DMACA_DMINT_CLEAR       = 0x00U, /**< Clear DMINT (disable interrupts) */
    DMACA_DMSTS_CLEAR       = 0x00U, /**< Clear DMSTS (clear status flags) */
    DMACA_DMCRB_CLEAR       = 0x00U, /**< Value written to DMCRB to clear it */
    DMACA_SWREQ_REQUEST     = 1U,    /**< SWREQ request bit value */
} dmaca_const_t;

/**
 * @enum dmaca_bitmap_t
 * @brief Bitmask helpers for tracking configured channels
 *
 * @details
 * The driver maintains a bitmap (s_channel_configured) where each bit
 * corresponds to a channel index.  This enum provides named constants for the
 * empty bitmap and the base bit value used when shifting by a channel index.
 * Using typed enum values avoids magic literals and clarifies intent when
 * manipulating the bitmap.
 *
 * @invariant Only the two enumerators are used; shifting by channel index is
 *            performed with DMACA_CHANNEL_BITMAP_BIT.
 *
 * @since 1.0.0
 */
typedef enum : uint8_t {
    DMACA_CHANNEL_BITMAP_NONE = 0U, /**< No channels configured */
    DMACA_CHANNEL_BITMAP_BIT  = 1U, /**< Base bit value for one channel */
} dmaca_bitmap_t;

/**
 * @enum dmaca_dte_t
 * @brief Values for the DMCNT.DTE bit
 *
 * @details
 * Used internally when enabling or disabling the DMA transfer engine for a
 * channel.  Grouped here as a typed enum for readability; the underlying
 * register field is one bit wide so the values are 0 or 1.
 *
 * @invariant dmaca_dte_t is a one-bit field constraint: values must be 0 or 1 
 * and correspond directly to the DMCNT.DTE register bit encoding in the RX72N 
 * datasheet.
 *
 * @code
 * // Example: enable DMA transfer engine for a channel
 * ch->dmcnt |= (uint8_t)DMACA_DTE_ENABLE;  // Set DTE = 1
 * // Example: disable DMA transfer engine
 * ch->dmcnt &= ~(uint8_t)DMACA_DTE_ENABLE;  // Clear DTE bit to disable
 * @endcode
 *
 * @see DMACA_DTE_ENABLE, DMACA_DTE_DISABLE, rx_dmaca_start, rx_dmaca_abort
 * @since 1.0.0
 */
typedef enum : uint8_t {
    DMACA_DTE_DISABLE = 0U, /**< DTE = 0, DMA engine disabled */
    DMACA_DTE_ENABLE  = 1U, /**< DTE = 1, DMA engine enabled  */
} dmaca_dte_t;

/**
 * @enum dmaca_timeout_scale_t
 * @brief Constants for DMA timeout calculation
 *
 * @details
 * Derived from worst-case per-transfer cycles and ICLK/PCLKB ratio.
 * At 240/60 MHz (ratio = 4): (Cr + Cw) = (1 + 4) = 5 PCLKB cycles
 * Per transfer: 5 x 4 = 20 ICLK iterations. Add 25% margin (5/4).
 *
 * @invariant These constants are compile-time invariants derived from the RX72N 
 * hardware clock configuration (240 MHz ICLK, 60 MHz PCLKB). They must not be 
 * modified and represent the per-transfer cost and margin parameters for timeout 
 * calculations in the DMACA polling loops.
 *
 * @code
 * // Example: compute timeout for a 256-byte transfer
 * uint32_t transfer_size = 256;  // bytes
 * uint32_t timeout = (transfer_size * K_DMACA_CYCLES_PER_XFER * 
 *                      K_DMACA_MARGIN_NUMERATOR) / K_DMACA_MARGIN_DENOMINATOR;
 * rx_dmaca_wait(channel, timeout);
 * @endcode
 *
 * @see K_DMACA_CYCLES_PER_XFER, K_DMACA_MARGIN_NUMERATOR, K_DMACA_MARGIN_DENOMINATOR, 
 *      rx_dmaca_transfer_blocking, rx_dmaca_wait
 * @since 1.0.0
 */
typedef enum : uint32_t {
    K_DMACA_CYCLES_PER_XFER     = 20U, /**< ICLK iterations per transfer */
    K_DMACA_MARGIN_NUMERATOR    = 5U,  /**< Bus contention margin numerator */
    K_DMACA_MARGIN_DENOMINATOR  = 4U,  /**< Bus contention margin denominator */
} dmaca_timeout_scale_t;

/* ------------------------------------------------------------------
 * DMTMD register bit definitions (transfer mode)
 * ------------------------------------------------------------------ */

/**
 * @enum dmtmd_shift_t
 * @brief Bit shift positions within the DMTMD (Transfer Mode) register
 *
 * @details
 * Defines the bit positions for the MD (mode) and SZ (size) fields
 * within the 16-bit DMTMD register. Used when constructing the
 * register value during channel configuration.
 *
 * @invariant DMTMD_MD_SHIFT and DMTMD_SZ_SHIFT must match the bit positions 
 * defined in the RX72N datasheet for correct register field masking and shifting.
 *
 * @code
 * // Example: construct DMTMD value with normal mode and byte size
 * uint16_t dmtmd = ((DMTMD_MD_NORMAL << DMTMD_MD_SHIFT) | 
 *                    (DMTMD_SZ_BYTE << DMTMD_SZ_SHIFT));
 * ch->dmtmd = dmtmd;
 * @endcode
 *
 * @see dmtmd_mode_t, dmtmd_size_t, rx_dmaca_configure, DMTMD_MD_SHIFT, DMTMD_SZ_SHIFT
 * @since 1.0.0
 */
typedef enum : uint16_t {
    DMTMD_MD_SHIFT = 14U, /**< Bit position for MD[1:0] transfer mode field */
    DMTMD_SZ_SHIFT = 8U,  /**< Bit position for SZ[1:0] data size field */
} dmtmd_shift_t;

/**
 * @enum dmtmd_mode_t
 * @brief Transfer mode field values for DMTMD.MD[1:0]
 *
 * @details
 * Selects the DMA transfer mode: normal (single transfer per request),
 * block (multiple transfers per request), or repeat (cyclic buffer mode).
 *
 * @invariant Values must match DMTMD.MD[1:0] encoding in RX72N datasheet: 
 * 0 = normal mode, 1 = block mode, 2 = repeat mode.
 *
 * @code
 * // Example: set block transfer mode in DMTMD register
 * uint16_t dmtmd = (DMTMD_MD_BLOCK << DMTMD_MD_SHIFT);
 * // mask for MD field: two-bit width
 * ch->dmtmd = (ch->dmtmd & ~((uint16_t)((1U << 2) - 1) << DMTMD_MD_SHIFT)) | dmtmd;
 * @endcode
 *
 * @see dmtmd_shift_t, rx_dmaca_configure, DMTMD_MD_NORMAL, DMTMD_MD_BLOCK, DMTMD_MD_REPEAT
 * @since 1.0.0
 */
typedef enum : uint16_t {
    DMTMD_MD_NORMAL  = 0U, /**< Normal mode: single transfer per activation */
    DMTMD_MD_BLOCK   = 1U, /**< Block mode: multiple transfers per activation */
    DMTMD_MD_REPEAT  = 2U, /**< Repeat mode: cyclic buffer operation */
} dmtmd_mode_t;

/**
 * @enum dmtmd_size_t
 * @brief Data size field values for DMTMD.SZ[1:0]
 *
 * @details
 * Selects the transfer data width. Only 8-bit (byte) and 32-bit (longword)
 * are supported for CRCDIR compatibility; 16-bit transfers are rejected.
 *
 * @invariant Values must match DMTMD.SZ[1:0] encoding in RX72N datasheet: 
 * 0 = byte (8-bit), 2 = longword (32-bit). Value 1 (16-bit word transfer) is 
 * not supported and must be rejected.
 *
 * @code
 * // Example: set longword transfer size
 * uint16_t dmtmd = (DMTMD_SZ_LONGWORD << DMTMD_SZ_SHIFT);
 * ch->dmtmd = (ch->dmtmd & ~(3U << DMTMD_SZ_SHIFT)) | dmtmd;
 * @endcode
 *
 * @see dmtmd_shift_t, rx_dmaca_configure, DMTMD_SZ_BYTE, DMTMD_SZ_LONGWORD
 * @since 1.0.0
 */
typedef enum : uint16_t {
    DMTMD_SZ_BYTE     = 0U, /**< 8-bit (byte) transfer width */
    DMTMD_SZ_LONGWORD = 2U, /**< 32-bit (longword) transfer width */
} dmtmd_size_t;

/* ------------------------------------------------------------------
 * DMAMD register bit definitions (address mode)
 * ------------------------------------------------------------------ */

/**
 * @enum dmamd_shift_t
 * @brief Bit shift positions for DMAMD register mode fields
 *
 * @details
 * Define the bit positions used to pack address mode fields into the DMAMD
 * register. SM (source mode) uses bits [15:14] and DM (destination mode)
 * uses bits [9:8].
 *
 * @invariant Values must match DMAMD register field positions in RX72N datasheet: 
 * SM[1:0] at bits [15:14], DM[1:0] at bits [9:8].
 *
 * @code
 * // Example: construct DMAMD register with increment source, fixed destination
 * uint16_t dmamd = ((DMAMD_SM_INCREMENT << DMAMD_SM_SHIFT) |
 *                    (DMAMD_DM_FIXED << DMAMD_DM_SHIFT));
 * ch->dmamd = dmamd;
 * @endcode
 *
 * @see dmamd_source_mode_t, dmamd_dest_mode_t, DMAMD_SM_SHIFT, DMAMD_DM_SHIFT
 * @since 1.0.0
 */
typedef enum : uint16_t {
    DMAMD_SM_SHIFT = 14U, /**< Bit position for SM[1:0] source address mode field */
    DMAMD_DM_SHIFT = 8U,  /**< Bit position for DM[1:0] destination address mode field */
} dmamd_shift_t;

/**
 * @enum dmamd_source_mode_t
 * @brief Source address mode field values for DMAMD.SM[1:0]
 *
 * @details
 * Selects how the source address is modified after each transfer:
 * fixed (no change), increment (address increases), or decrement (address
 * decreases). Used in conjunction with DMAMD_SM_SHIFT to set register bits.
 *
 * @invariant Values must match DMAMD.SM[1:0] encoding in RX72N datasheet: 
 * 0 = fixed, 2 = increment, 3 = decrement.
 *
 * @code
 * // Example: set source address increment mode
 * uint16_t dmamd = (DMAMD_SM_INCREMENT << DMAMD_SM_SHIFT);
 * ch->dmamd |= dmamd;
 * @endcode
 *
 * @see dmamd_shift_t, dmamd_dest_mode_t, DMAMD_SM_FIXED, DMAMD_SM_INCREMENT, DMAMD_SM_DECREMENT
 * @since 1.0.0
 */
typedef enum : uint16_t {
    DMAMD_SM_FIXED     = 0U, /**< Source address fixed (repeat address) */
    DMAMD_SM_INCREMENT = 2U, /**< Source address incremented after transfer */
    DMAMD_SM_DECREMENT = 3U, /**< Source address decremented after transfer */
} dmamd_source_mode_t;

/**
 * @enum dmamd_dest_mode_t
 * @brief Destination address mode field values for DMAMD.DM[1:0]
 *
 * @details
 * Selects how the destination address is modified after each transfer.
 * Currently only fixed mode (no change) is defined for CRC hardware use case.
 *
 * @invariant DMAMD_DM_FIXED value must match DMAMD.DM[1:0] encoding (0) in 
 * RX72N datasheet. Other modes are not currently supported.
 *
 * @code
 * // Example: set destination fixed (required for CRCDIR)
 * uint16_t dmamd = (DMAMD_DM_FIXED << DMAMD_DM_SHIFT);
 * ch->dmamd |= dmamd;
 * @endcode
 *
 * @see dmamd_shift_t, dmamd_source_mode_t, DMAMD_DM_FIXED
 * @since 1.0.0
 */
typedef enum : uint16_t {
    DMAMD_DM_FIXED = 0U, /**< Destination address fixed (repeat address) */
} dmamd_dest_mode_t;

/**
 * @brief  Obtain pointer to DMAC channel registers
 *
 * @details
 * Each DMAC channel exposes an identical register block.  The blocks are
 * located consecutively in memory starting at `k_dmac0_base_addr` with a
 * fixed `DMACA_CHANNEL_STRIDE`.  This helper computes the address for
 * the requested channel and returns a typed pointer for register access.
 *
 * @param[in] ch  Channel index (0 .. k_dmaca_num_channels-1).
 *
 * @return volatile rx_dmac_channel_regs_t *
 * @retval non-NULL Pointer to the channel's register block
 *
 * @pre k_dmac0_base_addr must be non-NULL and point to a valid DMAC register region
 * @pre DMACA_CHANNEL_STRIDE must be non-zero and match hardware register spacing
 * @pre ch must be a valid uint8_t index in range [0, k_dmaca_num_channels-1]
 *
 * @post Returned pointer equals k_dmac0_base_addr + (ch * DMACA_CHANNEL_STRIDE)
 * @post Returned pointer value >= k_dmac0_base_addr
 * @post Returned pointer value < k_dmac0_base_addr + (k_dmaca_num_channels * DMACA_CHANNEL_STRIDE)
 * @post Returned pointer is never NULL (asserted; function fails fast on NULL base)
 *
 * @note Thread safety: safe to call from any context; the calculation does not
 *       modify shared state.  The returned pointer should only be used with
 *       proper synchronization if the channel is accessed concurrently.
 *
 * @see rx_dmaca_start, rx_dmaca_abort, k_dmac0_base_addr, DMACA_CHANNEL_STRIDE
 * @since 1.0.0
 */
 
