Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_crc/src/rx_dmaca.c
static volatile rx_dmac_channel_regs_t * dmac_ch(uint8_t ch)
{
    /* Precondition: base address must be non-NULL */
    RX_ASSERT(k_dmac0_base_addr != 0U, "DMAC base address is NULL");
    /* Precondition: channel stride must be non-zero */
    RX_ASSERT(DMACA_CHANNEL_STRIDE != 0U, "DMACA channel stride is zero");
    /* Precondition: channel index must be valid */
    RX_ASSERT(ch < k_dmaca_num_channels, "DMACA invalid channel index");
    
    const uintptr_t addr = k_dmac0_base_addr + ((uintptr_t)ch * DMACA_CHANNEL_STRIDE);
    volatile rx_dmac_channel_regs_t *ptr = (volatile rx_dmac_channel_regs_t *)addr;
    
    /* Postcondition: result must not be NULL */
    RX_ASSERT(ptr != NULL, "DMACA computed channel pointer is NULL");
    /* Postcondition: result must be within valid channel region */
    RX_ASSERT((uintptr_t)ptr >= k_dmac0_base_addr, "DMACA pointer below base");
    RX_ASSERT((uintptr_t)ptr < (k_dmac0_base_addr + (k_dmaca_num_channels * DMACA_CHANNEL_STRIDE)),
              "DMACA pointer exceeds channel region");
    
    return ptr;
}

/* =========================================================================
 * Module-level state
 * ========================================================================= */

/**
 * @var s_dmaca_initialised
 * @brief DMACA initialization flag
 *
 * @details
 * This boolean indicates whether the DMACA driver has been successfully
 * initialized via rx_dmaca_init().  Public API calls use this flag to
 * reject requests made prior to initialization.  It is cleared during
 * module startup and set to true exactly once by rx_dmaca_init().
 *
 * @note This is a module-level static variable; it is not visible outside
 *       rx_dmaca.c and should only be accessed within this translation
 *       unit.
 *
 * @warning Direct modification of this variable is forbidden outside of
 *          this module.  Only rx_dmaca_init() or other internal helper
 *          routines are permitted to change its value.
 *
 * @since 1.0.0
 */
static bool s_dmaca_initialised = false;

/**
 * @var s_channel_configured
 * @brief Bitmap of channels with active or pending configurations
 *
 * @details
 * Each bit in this 8-bit bitmap corresponds to one DMACA channel.  When
 * bit N is set to 1 the associated channel N currently has an active
 * configuration or a configuration that is pending completion.  The flag is
 * manipulated by rx_dmaca_configure() and cleared when transfers complete.
 *
 * Bit semantics:
 *   - Bit 0 -> channel 0
 *   - Bit 1 -> channel 1
 *   - ...
 *
 * Bit N = 1 means channel N has an active or pending configuration.
 *
 * @note This variable has module-level scope; it is static to rx_dmaca.c and
 *       must not be referenced from other files.
 *
 * @warning Do not modify this bitmap directly outside of the module.  Changes
 *          should only occur through the initialization routine
 *          rx_dmaca_init() or internal APIs that manage channel state.
 *
 * @since 1.0.0
 */
static uint8_t s_channel_configured = 0U;

/* =========================================================================
 * Argument validation helpers
 * ========================================================================= */

/**
 * @brief  Validate a DMACA channel index.
 *
 * @details
 * Internal helper that checks whether the provided channel number falls
 * within the valid range of channels supported by the RX72N DMACA
 * peripheral.  Returns k_rx_ok for a valid index and k_rx_err_nack for
 * any out-of-range value.  This function is used by all public APIs to
 * centralise boundary checking.
 *
 * @param[in] channel DMACA channel index to validate.
 *                    Valid range is [0, k_dmaca_num_channels-1].
 *
 * @return rx_err_t  Result of validation.
 * @retval k_rx_ok      Channel index is within range.
 * @retval k_rx_err_nack Channel index is invalid (>= k_dmaca_num_channels).
 *
 * @pre  channel must be a uint8_t value providing an index for boundary validation
 * @pre  DMACA subsystem is in a state where channel index validation is meaningful
 *       (i.e., the DMACA module is accessible and k_dmaca_num_channels is properly initialized)
 *
 * @post Return value is either k_rx_ok or k_rx_err_nack
 * @post Returns k_rx_ok if and only if channel < k_dmaca_num_channels
 * @post Returns k_rx_err_nack if and only if channel >= k_dmaca_num_channels
 * @post No global state is modified; function has no side effects
 *
 * @note This is an internal, fast helper; callers should still handle the
 *       error return value appropriately.  Uses RX_ASSERT macros to validate
 *       preconditions during debug builds.
 *
 * @since 1.0.0
 *
 * @see k_dmaca_num_channels, k_rx_err_nack, k_rx_ok, RX_ASSERT, validate_channel
 */
static rx_err_t validate_channel(uint8_t channel)
{
    /* Precondition: k_dmaca_num_channels must be valid (non-zero) */
    RX_ASSERT(k_dmaca_num_channels > 0U,
              "DMACA validate_channel: num_channels constant is zero");
    /* postcondition: result must be one of the two defined codes */
    rx_err_t result;

    if (channel >= k_dmaca_num_channels) {
        result = k_rx_err_nack;
    } else {
        result = k_rx_ok;
    }

    RX_ASSERT((result == k_rx_ok) || (result == k_rx_err_nack),
             "DMACA validate_channel returned unexpected value");

    return result;
}

/* -------------------------------------------------------------------------
 * Internal helper routines extracted from rx_dmaca_configure().  Breaking the
 * original 139-line function into smaller pieces keeps each module under the
 * 60-line limit and improves readability.  Each helper returns an error
 * code so the caller can propagate failures.
 */

/**
 * @brief  Perform runtime validation of parameter structure.
 *
 * @details
 * Executes all of the argument checks that were previously embedded in
 * rx_dmaca_configure().  This includes null-pointer tests and value range
 * verifications for transfer count, data size, and source/destination
 * pointers.  Hardware-specific invariants such as supported transfer modes or
 * address modes are *not* checked here; those are handled by the register
 * configuration helpers.
 *
 * @param[in] p_cfg Pointer to the configuration structure.
 *
 * @return rx_err_t
 * @retval k_rx_ok       Parameters appear valid.
 * @retval k_rx_err_nack One or more fields are invalid (NULL or out of
 *                       allowable range).
 *
 * @pre  p_cfg may be NULL (checked by this helper).
 * @pre  If p_cfg is non-NULL, all fields (transfer_count, data_size, p_src,
 *       p_dst) must be initialized to defined values.
 *
 * @post If k_rx_ok is returned, the fields used by the configure helpers
 *       meet the constraints described above.
 * @post If k_rx_err_nack is returned, no global state is modified.
 *
 * @note This function is internal and not thread-safe.  Caller must still
 *       treat a non-zero return value as an error condition.
 *
 * @since 1.0.0
 */
static rx_err_t validate_config_params(const dmaca_config_t *p_cfg)
{
    /* Preconditions: NULL pointer is handled gracefully rather than asserted */
    if (p_cfg == NULL) {
        return k_rx_err_nack;
    }

    if ((p_cfg->transfer_count == 0U) ||
        (p_cfg->transfer_count > k_dmaca_max_transfer_count)) {
        return k_rx_err_nack;
    }

    if ((p_cfg->data_size != k_dmaca_size_byte) &&
        (p_cfg->data_size != k_dmaca_size_longword)) {
        return k_rx_err_nack;
    }

    if ((p_cfg->p_src == NULL) || (p_cfg->p_dst == NULL)) {
        return k_rx_err_nack;
    }

