Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_crc/src/rx_dmaca.c
    /* Postcondition: Validated invariants enforced in debug builds (NASA Rule 5) */
    RX_ASSERT((p_cfg->transfer_count != 0U) &&
              (p_cfg->transfer_count <= k_dmaca_max_transfer_count),
              "validate_config_params: transfer_count invariant violated");
    RX_ASSERT((p_cfg->data_size == k_dmaca_size_byte) ||
              (p_cfg->data_size == k_dmaca_size_longword),
              "validate_config_params: data_size invariant violated");

    return k_rx_ok;
}

/**
 * @brief  Populate the transfer mode register (DMTMD) for a channel.
 *
 * @details
 * Builds the 16-bit register value based on the configuration structure and
 * writes it to the channel's DMTMD register.  Only byte and longword data
 * sizes are supported; invalid transfer or data size values produce an error
 * code.
 *
 * @param[in] ch    Pointer to the channel registers.
 * @param[in] p_cfg Configuration parameters (assumed non-NULL).
 *
 * @return rx_err_t
 * @retval k_rx_ok       Register written successfully.
 * @retval k_rx_err_nack Unsupported transfer mode or data size.
 *
 * @pre  ch must point to a valid channel register block.
 * @pre  p_cfg must be non-NULL with valid transfer_mode and data_size fields.
 *
 * @post DMTMD register contains the encoded mode or prior value remains
 * @post On k_rx_ok, ch->dmtmd is updated atomically.
 *
 * @note Thread safety: NOT thread-safe. Caller must ensure exclusive access
 *       to the channel register block during configuration.
 *       unchanged on error.
 *
 * @since 1.0.0
 */
static rx_err_t configure_transfer_mode(volatile rx_dmac_channel_regs_t *ch,
                                        const dmaca_config_t *p_cfg)
{
    /* Preconditions */
    RX_ASSERT(ch != NULL, "Channel register pointer is NULL");
    RX_ASSERT(p_cfg != NULL, "Config pointer is NULL");

    uint16_t dmtmd = 0U;

    switch (p_cfg->transfer_mode) {
        case k_dmaca_mode_normal:
            dmtmd |= (DMTMD_MD_NORMAL << DMTMD_MD_SHIFT);
            break;
        case k_dmaca_mode_block:
            dmtmd |= (DMTMD_MD_BLOCK << DMTMD_MD_SHIFT);
            break;
        case k_dmaca_mode_repeat:
            dmtmd |= (DMTMD_MD_REPEAT << DMTMD_MD_SHIFT);
            break;
        default:
            return k_rx_err_nack;
    }

    if (p_cfg->data_size == k_dmaca_size_longword) {
        dmtmd |= (DMTMD_SZ_LONGWORD << DMTMD_SZ_SHIFT);
    } else {
        /* DMTMD_SZ_BYTE is zero (0U), so this shifts zero into place.
         * Kept explicitly for code clarity and symmetry with the longword case,
         * making it obvious that byte-size encoding is the zero value. */
        dmtmd |= (DMTMD_SZ_BYTE << DMTMD_SZ_SHIFT);
    }

    ch->dmtmd = dmtmd;
    return k_rx_ok;
}

/**
 * @brief  Populate the address mode register (DMAMD) for a channel.
 *
 * @details
 * Computes the DMAMD value from the configuration.  The current firmware
 * only supports a fixed destination address; attempts to use any other mode
 * return an error.
 *
 * @param[in] ch    Pointer to the channel registers.
 * @param[in] p_cfg Configuration parameters (assumed non-NULL).
 *
 * @return rx_err_t
 * @retval k_rx_ok       Register written successfully.
 * @retval k_rx_err_nack Unsupported address mode.
 *
 * @pre  ch must point to a valid channel register block.
 * @pre  p_cfg must be non-NULL with valid src_addr_mode and dst_addr_mode fields.
 *
 * @post DMAMD register contains the encoded mode or prior value remains
 *       unchanged on error.
 * @post On k_rx_ok, ch->dmamd is updated atomically.
 *
 * @note Thread safety: NOT thread-safe. Caller must ensure exclusive access
 *       to the channel register block during configuration.
 *
 * @since 1.0.0
 */
static rx_err_t configure_address_mode(volatile rx_dmac_channel_regs_t *ch,
                                       const dmaca_config_t *p_cfg)
{
    /* Preconditions */
    RX_ASSERT(ch != NULL, "Channel register pointer is NULL");
    RX_ASSERT(p_cfg != NULL, "Config pointer is NULL");

    uint16_t dmamd = 0U;

    switch (p_cfg->src_addr_mode) {
        case k_dmaca_addr_fixed:
            dmamd |= (DMAMD_SM_FIXED << DMAMD_SM_SHIFT);
            break;
        case k_dmaca_addr_increment:
            dmamd |= (DMAMD_SM_INCREMENT << DMAMD_SM_SHIFT);
            break;
        case k_dmaca_addr_decrement:
            dmamd |= (DMAMD_SM_DECREMENT << DMAMD_SM_SHIFT);
            break;
        default:
            return k_rx_err_nack;
    }

    if (p_cfg->dst_addr_mode != k_dmaca_addr_fixed) {
        return k_rx_err_nack;
    }
    dmamd |= (DMAMD_DM_FIXED << DMAMD_DM_SHIFT);

    ch->dmamd = dmamd;
    return k_rx_ok;
}

/**
 * @brief  Write source/destination/count registers for a channel.
 *
 * @details
 * Stops the DMA transfer (transfer enable bit must already be cleared by
 * caller) and writes the source address, destination address, and transfer
 * count registers.  The repeat count register is always cleared.
 *
 * @param[in] ch    Pointer to the channel registers.
 * @param[in] p_cfg Configuration parameters (assumed non-NULL).
 *
 * @return rx_err_t Always returns k_rx_ok; parameters have already been
 *                     validated.
 *
 * @pre  ch must point to a valid channel register block and the caller must
 *       have disabled DTE.
 * @pre  p_cfg must be non-NULL with valid p_src, p_dst, and transfer_count.
 *
 * @post Source, destination, and count registers reflect the supplied
 *       configuration.
 * @post ch->dmcrb is cleared to 0U.
 *
 * @note Thread safety: NOT thread-safe. Caller must ensure exclusive access
 *       to the channel register block during configuration.
 *
 * @since 1.0.0
 */
static rx_err_t configure_channel_regs(volatile rx_dmac_channel_regs_t *ch,
                                       const dmaca_config_t *p_cfg)
{
    /* Preconditions */
    RX_ASSERT(ch != NULL, "Channel register pointer is NULL");
    RX_ASSERT(p_cfg != NULL, "Config pointer is NULL");
    ch->dmsar = (uint32_t)(uintptr_t)p_cfg->p_src;
    ch->dmdar = (uint32_t)(uintptr_t)p_cfg->p_dst;
    ch->dmcra = (uint32_t)p_cfg->transfer_count;
    ch->dmcrb = (uint8_t)DMACA_DMCRB_CLEAR;
    return k_rx_ok;
}

/* =========================================================================
 * Public API implementation
 * ========================================================================= */

/**
 * @brief  Initialize the DMACA peripheral.
 *
 * @details
 * Releases the DMACA module from module-stop by setting the DMST bit in
 * the DMAST register.  This function also clears the per-channel configured
 * bitmap and marks the module as initialised.  It is safe to call multiple
 * times. Re-initialization without a reset is a programming error and will
 * trigger an assertion in debug builds.
 *
 * @return rx_err_t
 * @retval k_rx_ok  Initialization succeeded (module clock enabled, state reset).
 *
 * @pre  System clock configuration complete and __RX__ target (DMACA present).
 * @pre  No DMA transfers are active on any channel.
 *
 * @post DMACA module clock is enabled (MSTP(DMAC) == 0).
 * @post s_dmaca_initialised == true
 * @post s_channel_configured == 0U
 *
 * @note This routine is NOT thread-safe and should be called once from a
 *       single initialization context prior to any RTOS tasks using DMACA.
 *
 * @see dmac_dmast_reg(), k_dmast_dmst
 * @since 1.0.0
 */
rx_err_t rx_dmaca_init(void)
{
    
