Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_crc/src/rx_dmaca.c
    RX_ASSERT(dmac_dmast_reg() != NULL, "DMAC init: DMAST register pointer NULL");
    /* Idempotent: return early if already initialized.
     * Re-initialising without a reset is a programming error; debug builds
     * assert so callers can catch the mistake.  In release builds we simply
     * return success to preserve idempotent behaviour. */
    if (s_dmaca_initialised) {
        RX_ASSERT(!s_dmaca_initialised,
                  "DMAC init: re-initialisation without reset");
        return k_rx_ok;
    }

    /* DMAC is not affected by MSTP (11.4 in User's Manual) */
    /* Enable DMACA module-level operation (DMST bit in DMAST register). */
    /* hardware header provides helper for the DMAST register plus bit masks */
    *dmac_dmast_reg() |= (uint8_t)k_dmast_dmst;

    s_dmaca_initialised  = true;
    s_channel_configured = (uint8_t)DMACA_CHANNEL_BITMAP_NONE;

    RX_ASSERT(s_channel_configured == (uint8_t)DMACA_CHANNEL_BITMAP_NONE,
              "DMAC init did not clear channel bitmap");

    return k_rx_ok;
}

/**
 * @brief Configure a single DMACA channel for a transfer operation.
 *
 * @details
 * Writes the supplied configuration into the channel's register set
 * (DMSAR, DMDAR, DMCRA, DMTMD, DMAMD, DMINT, DMSTS, and DMCNT).
 * The values are latched immediately by the hardware; no DMA activity is
 * triggered by this call. The channel remains inactive (ACT == 0) until
 * rx_dmaca_start() is invoked.
 *
 * **Configuration steps:**
 * 1. Validates channel index (0 to k_dmaca_num_channels-1)
 * 2. Validates p_cfg pointer (non-NULL, all fields valid)
 * 3. Disables the channel (clears DTE bit)
 * 4. Programs source and destination addresses
 * 5. Configures transfer count, mode, data size, and address modes
 * 6. Clears interrupt flags and status
 * 7. Returns with channel disabled and ready for rx_dmaca_start()
 *
 * **Data size restrictions:**
 * Only k_dmaca_size_byte (8-bit) and k_dmaca_size_longword (32-bit) transfers
 * are supported. 16-bit (word) transfers are explicitly rejected because hardware
 * peripherals like CRCDIR do not accept 16-bit bus accesses. Requests for
 * unsupported sizes return k_rx_err_nack.
 *
 * **Transfer count validation:**
 * Must be in range [1, k_dmaca_max_transfer_count] inclusive. The RX72N DMACA
 * uses a 10-bit counter, limiting blocks to 1024 transfers maximum. Callers
 * must split larger buffers into multiple DMA operations.
 *
 * @param[in] channel DMACA channel index (0 to k_dmaca_num_channels-1).
 *                    Invalid indices return k_rx_err_nack without modifying
 *                    hardware.
 *
 * @param[in] p_cfg   Pointer to dmaca_config_t configuration structure.
 *                    Must not be NULL. All fields validated:
 *                    - p_src, p_dst: non-NULL, properly aligned
 *                    - transfer_count: [1, k_dmaca_max_transfer_count]
 *                    - data_size: k_dmaca_size_byte or k_dmaca_size_longword
 *                    - transfer_mode: k_dmaca_mode_normal, _block, or _repeat
 *                    - src_addr_mode: fixed, increment, or decrement
 *                    - dst_addr_mode: must be k_dmaca_addr_fixed (enforced)
 *
 * @return rx_err_t Error code indicating configuration result.
 * @retval k_rx_ok           Configuration accepted and channel registers updated.
 * @retval k_rx_err_nack     Invalid channel, NULL p_cfg, invalid transfer_count,
 *                           unsupported data_size (16-bit), NULL p_src/p_dst,
 *                           invalid transfer_mode, or dst_addr_mode != fixed.
 *
 * @pre rx_dmaca_init() has been called to enable DMACA peripheral clock.
 * @pre channel must be a valid DMACA channel index.
 * @pre The specified channel is idle (ACT == 0) and not in an active transfer.
 * @pre p_cfg points to valid, readable dmaca_config_t structure.
 * @pre p_cfg->p_src and p_cfg->p_dst are non-NULL and properly aligned.
 * @pre p_cfg->transfer_count is in range [1, k_dmaca_max_transfer_count].
 *
 * @post Channel's DMSAR, DMDAR, DMCRA, DMTMD, DMAMD, DMINT registers reflect
 *       the configuration in *p_cfg.
 * @post Channel remains disabled (DTE == 0) and does not transfer data.
 * @post All interrupt and status flags are cleared (DMINT clear).
 * @post Channel is ready for rx_dmaca_start() to arm and activate.
 *
 * @note **Thread Safety:** NOT reentrant for the same channel. Concurrent
 *       configuration of different channels requires external serialization
 *       to prevent hardware bus collisions. No internal locking is performed.
 *
 * @warning Configuring a channel while it is actively transferring
 *          (ACT == 1, DTE == 1) may produce unpredictable results. Ensure
 *          the channel is idle before calling (use rx_dmaca_abort() if needed).
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 5: [OK] 6 preconditions and 5 postconditions (exceeds minimum 2)
 * - Rule 7: [OK] All return values from validate_channel validated
 *
 * @see dmaca_config_t Structure containing all configuration parameters
 * @see rx_dmaca_init() Initialize DMACA module (must call first)
 * @see rx_dmaca_start() Arm and activate the configured channel
 * @see rx_dmaca_transfer_blocking() Combined configure + start + wait
 * @see validate_channel() Internal validation helper
 *
 * @since 1.0.0
 */
rx_err_t rx_dmaca_configure(uint8_t channel, const dmaca_config_t *p_cfg)
{
    rx_err_t err;
    volatile rx_dmac_channel_regs_t *ch;

    /* quick sanity asserts for debugging; runtime validity is handled below */
    RX_ASSERT(channel < k_dmaca_num_channels, "DMACA invalid channel");

    /* validate channel index first, then configuration parameters */
    err = validate_channel(channel);
    if (err != k_rx_ok) {
        return err;
    }

    err = validate_config_params(p_cfg);
    if (err != k_rx_ok) {
        return err;
    }

    /* stop the channel before touching any registers */
    ch = dmac_ch(channel);
    ch->dmcnt &= ~(uint8_t)DMACA_DTE_ENABLE;

    /* write basic registers */
    err = configure_channel_regs(ch, p_cfg);
    if (err != k_rx_ok) {
        return err;           /* should never happen */
    }

    err = configure_transfer_mode(ch, p_cfg);
    if (err != k_rx_ok) {
        return err;
    }

    err = configure_address_mode(ch, p_cfg);
    if (err != k_rx_ok) {
        return err;
    }

    /* disable interrupts and clear any stale status bits */
    ch->dmint = (uint8_t)DMACA_DMINT_CLEAR;
    ch->dmsts = (uint8_t)DMACA_DMSTS_CLEAR;

    /* mark channel configured so rx_dmaca_start can use it */
    s_channel_configured |= (uint8_t)(DMACA_CHANNEL_BITMAP_BIT << channel);
    /* Postcondition: channel must now be marked configured */
    RX_ASSERT((s_channel_configured & (uint8_t)(DMACA_CHANNEL_BITMAP_BIT << channel)) != 0U,
              "DMACA configure: channel not marked after configuration");

