Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_crc/src/rx_dmaca.c
    return k_rx_ok;
}

/**
 * @brief  Arm and activate a configured DMACA channel.
 *
 * @details
 * Sets the DTE bit for the specified channel and issues a software request
 * pulse (SWREQ) to start the DMA transfer.  The channel must have been
 * previously configured via rx_dmaca_configure() and must be idle.  This
 * function does **not** poll for completion; callers may use rx_dmaca_wait()
 * or rx_dmaca_transfer_blocking() after starting.
 *
 * @param[in] channel DMACA channel index (0 .. k_dmaca_num_channels-1).
 *
 * @return rx_err_t
 * @retval k_rx_ok       Transfer started successfully.
 * @retval k_rx_err_nack Channel index invalid, or channel not configured.
 *
 * @pre rx_dmaca_init() has been called.
 * @pre rx_dmaca_configure(channel, ...) has returned k_rx_ok.
 * @pre The channel is idle (not currently active).
 *
 * @post On success: Channel's DTE bit is set (transfer engine enabled).
 * @post On success: Software request issued; DMA transfer is in progress.
 * @post On failure: Channel state is unchanged.
 *
 * @note Thread safety: callers must ensure exclusive access to the channel
 *       being started.  Concurrent starts on the same channel will lead to
 *       undefined hardware behaviour.
 *
 * @see rx_dmaca_configure(), rx_dmaca_wait(), rx_dmaca_transfer_blocking()
 * @since 1.0.0
 */
rx_err_t rx_dmaca_start(uint8_t channel)
{
    rx_err_t err;

    /* Precondition assertions */
    RX_ASSERT(channel < k_dmaca_num_channels, "DMACA invalid channel index");

    err = validate_channel(channel);
    if (err != k_rx_ok) {
        return err;
    }

    if ((s_channel_configured & (uint8_t)(DMACA_CHANNEL_BITMAP_BIT << channel)) == 0U) {
        /* Channel has not been configured. */
        return k_rx_err_nack;
    }

    volatile rx_dmac_channel_regs_t *ch = dmac_ch(channel);
    RX_ASSERT(ch != NULL, "DMACA start: channel register pointer NULL");
    RX_ASSERT((s_channel_configured & (uint8_t)(DMACA_CHANNEL_BITMAP_BIT << channel)) != 0U,
              "DMACA start: channel not marked configured");

    /* Enable DMA transfer for this channel. */
    ch->dmcnt |= (uint8_t)DMACA_DTE_ENABLE;

    /* Issue software request (SWREQ pulse -> triggers the block transfer). */
    ch->dmreq |= (uint8_t)DMACA_SWREQ_REQUEST;

    return k_rx_ok;
}

/**
 * @brief  Wait for a DMA transfer to complete on a channel.
 *
 * @details
 * Implements bounded polling on the ACT (active) bit in the DMSTS register.
 * When ACT clears to 0, the transfer has completed. If the timeout expires
 * before completion, the function disables the transfer engine and returns
 * an error. The polling loop satisfies NASA Rule 2 (bounded loops) by using
 * the caller-supplied timeout_cycles as the iteration limit.
 * @param[in] channel        DMACA channel index (0 .. k_dmaca_num_channels-1).
 * @param[in] timeout_cycles Maximum polling iterations before timing out.
 *                            The timeout value should be computed using
 *                            the helper constants in dmaca_timeout_scale_t
 *                            or by calling rx_dmaca_transfer_blocking().
 *
 * @return rx_err_t
 * @retval k_rx_ok          Transfer completed before timeout.
 * @retval k_rx_err_timeout Timeout occurred; transfer engine disabled.
 * @retval k_rx_err_nack    Invalid channel or channel not configured.
 * @retval k_rx_err_nack    validate_channel() failure.
 *
 * @pre rx_dmaca_init() and rx_dmaca_configure() have been called for the
 *      specified channel, and rx_dmaca_start() has been invoked.
 * @pre timeout_cycles > 0 (zero while ACT=1 results in immediate k_rx_err_timeout;
 *      if ACT=0, returns k_rx_ok immediately regardless of timeout).
 * @post On k_rx_ok: Transfer completed, channel configured flag cleared.
 * @post On k_rx_err_timeout: Transfer engine disabled, configured flag cleared.
 * @post On k_rx_err_nack: Channel state unchanged.
 *
 * @note Implements a bounded polling loop; see NASA Rule 2 for reasoning.
 *       This function does **not** disable interrupts or yield the CPU.
 *
 * @see rx_dmaca_start, rx_dmaca_configure, rx_dmaca_transfer_blocking
 * @since 1.0.0
 */
rx_err_t rx_dmaca_wait(uint8_t channel, uint32_t timeout_cycles)
{
    rx_err_t err;

    /* Preconditions / assertions */
    RX_ASSERT(channel < k_dmaca_num_channels, "DMACA wait: invalid channel");

    err = validate_channel(channel);
    if (err != k_rx_ok) {
        return err;
    }

    RX_ASSERT((s_channel_configured & (uint8_t)(DMACA_CHANNEL_BITMAP_BIT << channel)) != 0U,
              "DMACA wait: channel not configured");

    if ((s_channel_configured & (uint8_t)(DMACA_CHANNEL_BITMAP_BIT << channel)) == 0U) {
        return k_rx_err_nack;
    }
    volatile rx_dmac_channel_regs_t *ch = dmac_ch(channel);

    /*
     * Bounded polling loop -- NASA Rule 2 compliance.
     *
     * We poll the ACT bit (transfer active flag) in DMSTS.
     * ACT = 1: DMA is running or waiting for bus.
     * ACT = 0: Transfer complete (or not yet started).
     *
     * Secondary check: DTE auto-clears to 0 after block completion.
     *
     * The timeout counter counts loop iterations, not exact CPU cycles,
     * but each iteration reads a volatile peripheral register (>= 4 cycles
     * at 60 MHz PCLKB / 240 MHz ICLK), so the bound is conservative.
     */
    uint32_t remaining = timeout_cycles;

    while ((ch->dmsts & k_dmsts_act) != 0U)
    {
        if (remaining == 0U) {
            /* Timeout: forcibly disable channel before returning. */
            ch->dmcnt &= ~(uint8_t)DMACA_DTE_ENABLE;
            s_channel_configured &= (uint8_t)(~(DMACA_CHANNEL_BITMAP_BIT << channel));
            return k_rx_err_timeout;
        }
        remaining--;
    }

    /* Transfer ended normally -- clear the configured flag. */
    s_channel_configured &= (uint8_t)(~(DMACA_CHANNEL_BITMAP_BIT << channel));

    return k_rx_ok;
}

/**
 * @brief Abort an ongoing DMA transfer on a channel.
 *
 * @details
 * Public API is tolerant of out-of-range channel values and will return
 * without side-effects when an invalid index is provided.  For debug builds
 * callers' assumptions are verified with `RX_ASSERT(channel < k_dmaca_num_channels, ...)`.
 *
 * @param[in] channel DMACA channel index to abort (0..k_dmaca_num_channels-1)
 *
 * @note The function performs a runtime no-op for invalid channel indexes.
 *
 * @note Thread safety: NOT thread-safe for the same channel. Concurrent
 *       abort and start/wait operations on the same channel require external
 *       synchronization.
 *
 * @return void No return value; operation is performed via side-effects on
 *         hardware registers and module state.
 *
 * @retval none
 *
 * @pre channel is an integer (uint8_t) representing the desired DMACA
 *      channel; if it is outside the valid range the call is a no-op.
 * @pre DMACA peripheral clock must be enabled (MSTP bit cleared) so that
 *      register accesses are valid.
 *
 * @post If channel is valid: DMA transfer engine for that channel is
 *       disabled and the module's configured-bit bitmap is cleared.
 * @post If channel is invalid: no hardware registers are modified and the
 *       function returns without side-effects.
 *
 * @par Example:
 * @code
 * // abort channel 3 before reconfiguring it
 * rx_dmaca_abort(3);
 * // caller may then safely call rx_dmaca_configure(3, &new_cfg);
 * @endcode
 *
 * @see dmac_ch(), RX_ASSERT
 * @since 1.0.0
 */
void rx_dmaca_abort(uint8_t channel)
{
    /* Validate caller assumptions in debug builds. Public API remains tolerant
     * and performs a no-op for out-of-range indices. */
    RX_ASSERT(channel < k_dmaca_num_channels, "DMACA invalid channel index");

