Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_crc/src/rx_dmaca.c
    if (channel >= k_dmaca_num_channels) {
        /* no-op for invalid index, per API contract */
        return;
    }

    volatile rx_dmac_channel_regs_t *ch = dmac_ch(channel);

    /* disable transfer engine and clear configured flag */
    ch->dmcnt &= ~(uint8_t)DMACA_DTE_ENABLE;
    s_channel_configured &= (uint8_t)(~(DMACA_CHANNEL_BITMAP_BIT << channel));

    RX_ASSERT((s_channel_configured & (uint8_t)(DMACA_CHANNEL_BITMAP_BIT << channel)) == 0U,
              "DMACA channel still configured after abort");
}

/**
 * @brief  Configure, start, and wait for a DMA transfer in one call.
 *
 * @details
 * Convenience wrapper that sequentially calls rx_dmaca_configure(),
 * rx_dmaca_start(), and rx_dmaca_wait() using a computed timeout based on
 * the configured block size.  This simplifies common usage patterns where
 * the caller merely wants to perform a single blocking DMA transfer.
 *
 * The timeout is scaled from the transfer_count using the constants defined
 * in dmaca_timeout_scale_t and is floored at RX_DMACA_POLL_TIMEOUT_CYCLES.
 *
 * @param[in] channel DMACA channel index (0 .. k_dmaca_num_channels-1).
 * @param[in] p_cfg   Pointer to a valid dmaca_config_t structure.  Must not
 *                    be NULL and transfer_count must be non-zero.
 *
 * @return rx_err_t
 * @retval k_rx_ok         Transfer completed successfully before timeout.
 * @retval k_rx_err_nack   Configuration or start failed (invalid arguments).
 * @retval k_rx_err_timeout Timed out while waiting for completion.
 *
 * @pre rx_dmaca_init() has been invoked.
 * @pre Channel index is valid and p_cfg points to a properly initialized
 *      configuration block.
 *
 * @post On k_rx_ok: Transfer completed, channel idle, configured flag cleared.
 * @post On k_rx_err_timeout: Channel disabled, configured flag cleared.
 * @post On k_rx_err_nack: Channel state depends on which sub-call failed.
 *
 * @note For fine-grained timeouts or non-blocking behaviour, callers may
 *       invoke the underlying API functions individually.
 * @note Thread safety: NOT thread-safe. Caller must ensure exclusive access
 *       to the specified channel for the duration of the blocking transfer.
 *
 * @see rx_dmaca_wait(), rx_dmaca_configure(), rx_dmaca_start()
 * @since 1.0.0
 */
rx_err_t rx_dmaca_transfer_blocking(uint8_t channel, const dmaca_config_t *p_cfg)
{
    rx_err_t err;

    /* defensive assertions */
    RX_ASSERT(p_cfg != NULL, "DMACA transfer_blocking: p_cfg is NULL");
    RX_ASSERT(p_cfg->transfer_count != 0U,
              "DMACA transfer_blocking: zero transfer_count");
    RX_ASSERT(channel < k_dmaca_num_channels,
              "DMACA transfer_blocking: invalid channel");

    err = rx_dmaca_configure(channel, p_cfg);
    if (err != k_rx_ok) {
        return err;
    }

    err = rx_dmaca_start(channel);
    if (err != k_rx_ok) {
        return err;
    }

    /*
     * Scale timeout to the configured block size.
     *
     * Worst-case per-transfer: (Cr + Cw) = (1 + 4) = 5 PCLKB cycles
     * At 240/60 MHz (ICLK/PCLKB ratio = 4): 5 x 4 = 20 ICLK iterations
     * Add 25 % bus contention margin for EXDMAC priority preemption.
     *
     * Minimum floor = RX_DMACA_POLL_TIMEOUT_CYCLES to cover DMA startup
     * overhead and very small blocks where the formula underestimates.
     */
    uint32_t transfer_count = (uint32_t)p_cfg->transfer_count;
    uint32_t cycles = K_DMACA_CYCLES_PER_XFER;
    uint32_t numerator = K_DMACA_MARGIN_NUMERATOR;
    uint32_t denominator = K_DMACA_MARGIN_DENOMINATOR;
    /* guard against overflow by using 64-bit intermediate multiplication */
    uint64_t prod = (uint64_t)transfer_count * (uint64_t)cycles * (uint64_t)numerator;
    uint32_t scaled = (uint32_t)(prod / (uint64_t)denominator);
    uint32_t timeout = (scaled > RX_DMACA_POLL_TIMEOUT_CYCLES)
                       ? scaled
                       : RX_DMACA_POLL_TIMEOUT_CYCLES;

    return rx_dmaca_wait(channel, timeout);
}